import React, { Component } from 'react';
import { Text, View, Image, ScrollView, Alert, style, Dimensions, ImageBackground, StyleSheet } from 'react-native';
import { widthPercentageToDP as wp, heightPercentageToDP as hp } from 'react-native-responsive-screen';
import axios from 'axios';
import Icon from 'react-native-vector-icons/Ionicons';
import MapView from 'react-native-maps';
import { Button } from 'react-native-elements';
import { TouchableHighlight, TouchableOpacity } from 'react-native-gesture-handler';

export class GeneralData extends Component {
	static navigationOptions = ({ navigation }) => {
		return {
			headerLeft: (
				<View style={{ marginLeft: 10 }}>
					<Text onPress={() => navigation.goBack()}>
						{<Icon name="ios-arrow-round-back" color={'white'} size={40} />}
					</Text>
				</View>
			),
			headerTitle: (
				<View>
					<Text style={{ fontFamily: 'Prompt-Regular', color: '#FFF', fontSize: 20 }}>
						{'ข้อมูลทั่วไปเทศบาล'}
					</Text>
				</View>
			),

			headerStyle: {
				backgroundColor: '#6633cc',
			},
			headerTintColor: '#fff',
			headerTitleStyle: {
				fontWeight: 'bold',
			},
		};
	};

	render() {
		return (
			<ImageBackground
				source={require('../image/violetbg2.png')}
				resizeMode="stretch"
				style={{ width: '100%', height: '100%', justifyContent: 'flex-start', alignItems: 'center' }}
			>
				<ScrollView style={{ flex: 1 }}>
					<Image
						source={require('../image/logosananrak.png')}
						style={{ width: 200, height: 200, marginTop: 20, alignItems: 'center', alignSelf: 'center' }}
					/>
					<Text style={styles.Detail}> ประวัติความเป็นมา </Text>
					<Text style={styles.TitleDetail}>
						{' '}
						แต่เดิมสนั่นรักษ์เป็นเพียงตำบลเล็กๆ สองตำบลรวมกันในอำเภอธัญบุรี จังหวัดปทุมธานี
						เมืองปริมณฑลที่มีอาณาเขตพื้นที่ครอบคลุมตั้งแต่คลอง 9 ถึงคลอง 14 พื้นที่ส่วนใหญ่เป็นป่าทึบ
						มีแหล่งน้ำขนาดใหญ่ 2 แห่ง แห่งแรกเป็นบึงน้ำที่อยู่บริเวณคลอง 12 - 13 ลักษณะเด่นของบึงนี้ คือ
						มีน้ำใสและเต็มมองเห็นเป็นสีดำ ชาวบ้านละแวดนั้นจึงเรียกบึงนี้ว่า บึงน้ำรัก
						แต่เมื่อกาลเวลาเปลี่ยนผ่านวิวัฒนาการแห่งภาษาได้เปลี่ยนแปลงให้ บึงน้ำรัก กลายเป็น บึงน้ำรักษ์
						ในเวลาต่อมา กอปรกับแหล่งน้ำอีกแห่งอยู่ไม่ไกลจากบึงน้ำรักษ์มากนัก
						บึงน้ำแห่งนี้เป็นบึงน้ำที่มีสัตว์ป่าเป็นจำนวนมากลงมากินน้ำ ทำให้เกิดส่งเสียงเอ็ดอึงอยู่เป็นประจำ
						ชาวบ้านแถบนั้นจึงขนานนามบึงตามเสียงอื้ออึงว่า บึงสนั่น ด้วยเหตุนี้ ชื่อเมืองสนั่นรักษ์
						จึงถือกำเนิดขึ้น โดยการนำชื่อท้ายของบึงสนั่นและบึงน้ำรักษ์หลอมรวมเข้าด้วยกัน
						สภาพเมืองสนั่นรักษ์ในอดีตเป็นเพียงป่ารกชัฏ แม้จะมีดินอุดมดีแต่พื้นที่ยังขาดแคลนน้ำ
						พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัวฯ จึงทรงโปรดเกล้าฯ ให้ขุดคลองขึ้นในปี พ.ศ.2433
						จากแม่น้ำเจ้าพระยาที่ตำบลบ้านใหม่ อำเภอเมืองปทุมธานี ถึงเขตจังหวัดนครนายก
						และพระราชทานนามคลองแห่งนี้ว่า คลองรังสิตประยูรศักดิ์
						เพื่อให้พื้นที่ดังกล่าวเป็นแหล่งน้ำเพื่อใช้ในการประกอบอาชีพของผู้ที่อาศัยในละแวกนั้น
						ปัจจุบันเมืองสนั่นรักษ์มีลักษณะทางกายภาพเป็นพื้นที่ราบลุ่มที่เหมาะแก่การทำการเกษตร
						อีกทั้งยังมีคลองรังสิตประยูรศักดิ์ ไหลตัดผ่านกลางพื้นที่
						ซึ่งเหมาะอย่างยิ่งสำหรับเป็นแหล่งส่งน้ำเพื่อประโยชน์ด้านกสิกรรม ปลูกพืชสวนและพืชไร่
						เนื่องจากมีน้ำใช้ตลอดทั้งปี ประกอบกับลักษณะของดินเป็นดินเหนียว เนื้อดินละเอียด
						สามารถอุ้มน้ำและกักเก็บน้ำได้ค่อนข้างดี จึงเหมาะแก่การปลูกพืชสวน
						โดยเฉพาะสวนส้มเขียวหวานซึ่งถือเป็นสินค้าส่งออกและพืชเศรษฐกิจของเทศบาลเมืองสนั่นรักษ์
						ด้วยเป็นเมืองปริมณฑลมีพื้นที่อุดมสมบูรณ์ทั้งดินดี น้ำใช้สะอาด อากาศบริสุทธิ์
						จึงทำให้เมืองสนั่นรักษ์กลายเป็นอีกแหล่งที่อยู่อาศัยที่มีผู้คนอพยพโยกย้ายถิ่นฐานเข้ามาอยู่ในพื้นที่เพิ่มมากขึ้น
						ส่งผลให้เกิดการเจริญเติบโตอย่างก้าวกระโดดในระยะเวลาเพียงไม่นานนัก จากคำบอกเล่าสืบต่อกันมา
						ตำบลบึงสนั่นและตำบลบึงน้ำรักษ์ ในอดีตเป็นพื้นที่ส่วนหนึ่งของอำเภอรังสิต (อำเภอธัญบุรีในปัจจุบัน)
						เรียกว่า ทุ่งหลวง จากเมืองเล็กๆ ที่ได้รับการพัฒนาให้เจริญก้าวหน้าอย่างต่อเนื่อง
						กระทั่งกลายเป็นเมืองขนาดกลาง กอปรกับเป็นเมืองปริมณฑลจึงมีผู้คนอพยพเข้ามาอาศัยเพิ่มขึ้น
						ส่งผลให้เขตพื้นที่ดังกล่าวได้รับการยกระดับให้เป็นสุขาภิบาลและตั้งชื่อใหม่ว่า สุขาภิบาลสนั่นรักษ์
						เมื่อวันที่ 24 ธันวาคม 2519 และเมื่อวันที่ 25 พฤษภาคม 2542
						สุขาภิบาลสนั่นรักษ์ได้เปลี่ยนแปลงฐานะเป็นเทศบาลตำบลสนั่นรักษ์
						ตามพระราชบัญญัติเปลี่ยนแปลงฐานะสุขาภิบาลเป็นเทศบาลเพื่อให้การกระจายอำนาจจากส่วนกลางลงไปสู่ท้องถิ่นได้อย่างทั่วถึง
						และด้วยความมุ่งมาดปรารถนาอย่างตั้งใจจริงของท่านนายกฯ สมชาย รังสิวัฒนศักดิ์
						ในการบริหารพัฒนาตำบลสนั่นรักษ์ให้เจริญก้าวหน้าทัดเทียมท้องถิ่นอื่นๆ
						จึงสามารถทำให้มีการยกระดับเทศบาลตำบลสนั่นรักษ์ขึ้นเป็นเทศบาลเมืองสนั่นรักษ์ในเวลาต่อมา
					</Text>
					<Text style={styles.Detail}>ความเป็นมาอาคารสำนักงานเทศบาลเมืองสนั่นรักษ์</Text>
					<Text style={styles.TitleDetail}>
						สมัยแรกเริ่มสำนักงานเทศบาลเมืองสนั่นรักษ์ ได้ก่อสร้างอาคารสำนักงานเมื่อ พ.ศ.2543 จำนวน 1 หลัง 3
						ชั้น ประกอบด้วย หน่วยงานภายใน 7 หน่วย ได้แก่ สำนักงานปลัดเทศบาล กองคลัง กองช่าง กองสาธารณสุข
						กองการศึกษา กองวิชาการและแผนงาน และกองสวัสดิการสังคม
						ระยะต่อมาความต้องการรับบริการของประชาชนที่มาติดต่อราชการมีเพิ่มขึ้น
						เพื่ออำนวยความสะดวกในการให้บริการ คณะผู้บริหารและสมาชิกสภาเทศบาลจึงเห็นชอบให้ดำเนินการก่อสร้าง
						อาคารสำนักงานเทศบาลเมืองสนั่นรักษ์หลังใหม่ขึ้น โดยจัดให้มีพิธีวางศิลาฤกษ์ เมื่อวันที่ 7 มิถุนายน
						2550 ณ บริเวณหน้าสำนักงานเทศบาลหลังเดิม ปัจจุบันอาคารสำนักงานเทศบาลเมืองสนั่นรักษ์
						ตั้งอยู่เลขที่ 888 หมู่ที่ 2 ตำบลบึงน้ำรักษ์ อำเภอธัญบุรี จังหวัดปทุมธานี เป็นอาคาร ค.ส.ล.
						ขนาดความสูง 4 ชั้น พร้อมติดตั้งระบบไฟฟ้า ระบบสุขาภิบาล ระบบปรับอาคาร ระบบลิฟท์
						มีพื้นที่ใช้สอยรวมประมาณ 4,380 ตารางเมตร จำนวน 1 หลัง ราคาก่อสร้าง 74,722,000 บาท
						โดยปรับปรุงภูมิทัศน์และตกแต่งภายในให้สวยงาม
						รวมทั้งมีอุปกรณ์และเทคโนโลยีที่ทันสมัยเพื่ออำนวยความสะดวกแก่ประชาชนที่เข้ารับบริการจากทางเทศบาล
					</Text>
					<Text style={styles.Detail}>ความภาคภูมิใจของชาวสนั่นรักษ์</Text>
					<Text style={styles.TitleDetail}>
						{' '}
						เทศบาลเมืองสนั่นรักษ์ ได้รับรางวัลชมเชย (เทศบาลขนาดกลาง) ในการเข้าร่วมโครงการ
						"ประเมินเทศบาลน่าอยู่อย่างยั่งยืน ประจำปี 2550"
						และได้เข้ารับโล่และเกียรติบัตรจากการเข้าร่วมโครงการ "เทศบาลน่าอยู่ด้านสุขภาพ ประจำปี 2551
						และรางวัล Best Practice Model" จากศูนย์อนามัยที่ 1 กรมอนามัย กระทรวงสาธารณสุข
						ซึ่งทางเทศบาลเมืองสนั่นรักษ์สามารถพัฒนาเป็นเทศบาลน่าอยู่ด้านสุขภาพ
						โดยผ่านเกณฑ์การประเมินด้านกระบวนการเมืองน่าอยู่ และมีผลสัมฤทธิ์ด้านอนามัยสิ่งแวดล้อมในระดับ 1
						และรางวัล Best Practice Model ของพื้นที่เขต 1 ด้วย
					</Text>
				</ScrollView>
			</ImageBackground>
		);
	}
}

const styles = StyleSheet.create({
	Detail: {
		fontFamily: 'Prompt-Regular',
		color: '#000',
		fontSize: 20,
		alignSelf: 'center',
	},
	TitleDetail: {
		fontFamily: 'Prompt-Light',
		color: '#000',
		fontSize: 16,
	},
});

export default GeneralData;
